RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN236/MCXN236/MCXN236.h
#define DMA_TCD_BITER_ELINKYES_LINKCH_MASK       (0x1E00U)  /* Merged from fields with different position or width, of widths (3, 4), largest definition used */
#define DMA_TCD_BITER_ELINKYES_LINKCH_SHIFT      (9U)
/*! LINKCH - Link Channel Number */
#define DMA_TCD_BITER_ELINKYES_LINKCH(x)         (((uint16_t)(((uint16_t)(x)) << DMA_TCD_BITER_ELINKYES_LINKCH_SHIFT)) & DMA_TCD_BITER_ELINKYES_LINKCH_MASK)  /* Merged from fields with different position or width, of widths (3, 4), largest definition used */

#define DMA_TCD_BITER_ELINKYES_ELINK_MASK        (0x8000U)
#define DMA_TCD_BITER_ELINKYES_ELINK_SHIFT       (15U)
/*! ELINK - Enable Link
 *  0b0..Channel-to-channel linking disabled
 *  0b1..Channel-to-channel linking enabled
 */
#define DMA_TCD_BITER_ELINKYES_ELINK(x)          (((uint16_t)(((uint16_t)(x)) << DMA_TCD_BITER_ELINKYES_ELINK_SHIFT)) & DMA_TCD_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/* The count of DMA_TCD_BITER_ELINKYES */
#define DMA_TCD_BITER_ELINKYES_COUNT             (16U)


/*!
 * @}
 */ /* end of group DMA_Register_Masks */


/* DMA - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral DMA0 base address */
  #define DMA0_BASE                                (0x50080000u)
  /** Peripheral DMA0 base address */
  #define DMA0_BASE_NS                             (0x40080000u)
  /** Peripheral DMA0 base pointer */
  #define DMA0                                     ((DMA_Type *)DMA0_BASE)
  /** Peripheral DMA0 base pointer */
  #define DMA0_NS                                  ((DMA_Type *)DMA0_BASE_NS)
  /** Peripheral DMA1 base address */
  #define DMA1_BASE                                (0x500A0000u)
  /** Peripheral DMA1 base address */
  #define DMA1_BASE_NS                             (0x400A0000u)
  /** Peripheral DMA1 base pointer */
  #define DMA1                                     ((DMA_Type *)DMA1_BASE)
  /** Peripheral DMA1 base pointer */
  #define DMA1_NS                                  ((DMA_Type *)DMA1_BASE_NS)
  /** Array initializer of DMA peripheral base addresses */
  #define DMA_BASE_ADDRS                           { DMA0_BASE, DMA1_BASE }
  /** Array initializer of DMA peripheral base pointers */
  #define DMA_BASE_PTRS                            { DMA0, DMA1 }
  /** Array initializer of DMA peripheral base addresses */
  #define DMA_BASE_ADDRS_NS                        { DMA0_BASE_NS, DMA1_BASE_NS }
  /** Array initializer of DMA peripheral base pointers */
  #define DMA_BASE_PTRS_NS                         { DMA0_NS, DMA1_NS }
#else
  /** Peripheral DMA0 base address */
  #define DMA0_BASE                                (0x40080000u)
  /** Peripheral DMA0 base pointer */
  #define DMA0                                     ((DMA_Type *)DMA0_BASE)
  /** Peripheral DMA1 base address */
  #define DMA1_BASE                                (0x400A0000u)
  /** Peripheral DMA1 base pointer */
  #define DMA1                                     ((DMA_Type *)DMA1_BASE)
  /** Array initializer of DMA peripheral base addresses */
  #define DMA_BASE_ADDRS                           { DMA0_BASE, DMA1_BASE }
  /** Array initializer of DMA peripheral base pointers */
  #define DMA_BASE_PTRS                            { DMA0, DMA1 }
#endif
/** Interrupt vectors for the DMA peripheral type */
#define DMA_IRQS                                 { { EDMA_0_CH0_IRQn, EDMA_0_CH1_IRQn, EDMA_0_CH2_IRQn, EDMA_0_CH3_IRQn, EDMA_0_CH4_IRQn, EDMA_0_CH5_IRQn, EDMA_0_CH6_IRQn, EDMA_0_CH7_IRQn, EDMA_0_CH8_IRQn, EDMA_0_CH9_IRQn, EDMA_0_CH10_IRQn, EDMA_0_CH11_IRQn, EDMA_0_CH12_IRQn, EDMA_0_CH13_IRQn, EDMA_0_CH14_IRQn, EDMA_0_CH15_IRQn }, \
                                                   { EDMA_1_CH0_IRQn, EDMA_1_CH1_IRQn, EDMA_1_CH2_IRQn, EDMA_1_CH3_IRQn, EDMA_1_CH4_IRQn, EDMA_1_CH5_IRQn, EDMA_1_CH6_IRQn, EDMA_1_CH7_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn } }

/*!
 * @}
 */ /* end of group DMA_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DMA0_TEE_ALIAS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA0_TEE_ALIAS_Peripheral_Access_Layer DMA0_TEE_ALIAS Peripheral Access Layer
 * @{
 */

/** DMA0_TEE_ALIAS - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4092];
       uint32_t RESERVED;                          /**< Reserved., offset: 0xFFC */
} DMA0_TEE_ALIAS_Type;

/* ----------------------------------------------------------------------------
   -- DMA0_TEE_ALIAS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA0_TEE_ALIAS_Register_Masks DMA0_TEE_ALIAS Register Masks
 * @{
 */


/*!
 * @}
 */ /* end of group DMA0_TEE_ALIAS_Register_Masks */


/* DMA0_TEE_ALIAS - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral DMA0_TEE_ALIAS0 base address */
  #define DMA0_TEE_ALIAS0_BASE                     (0x50080000u)
  /** Peripheral DMA0_TEE_ALIAS0 base address */
  #define DMA0_TEE_ALIAS0_BASE_NS                  (0x40080000u)
  /** Peripheral DMA0_TEE_ALIAS0 base pointer */
  #define DMA0_TEE_ALIAS0                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS0_BASE)
  /** Peripheral DMA0_TEE_ALIAS0 base pointer */
  #define DMA0_TEE_ALIAS0_NS                       ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS0_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS1 base address */
  #define DMA0_TEE_ALIAS1_BASE                     (0x50081000u)
  /** Peripheral DMA0_TEE_ALIAS1 base address */
  #define DMA0_TEE_ALIAS1_BASE_NS                  (0x40081000u)
  /** Peripheral DMA0_TEE_ALIAS1 base pointer */
  #define DMA0_TEE_ALIAS1                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS1_BASE)
  /** Peripheral DMA0_TEE_ALIAS1 base pointer */
  #define DMA0_TEE_ALIAS1_NS                       ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS1_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS2 base address */
  #define DMA0_TEE_ALIAS2_BASE                     (0x50082000u)
  /** Peripheral DMA0_TEE_ALIAS2 base address */
  #define DMA0_TEE_ALIAS2_BASE_NS                  (0x40082000u)
  /** Peripheral DMA0_TEE_ALIAS2 base pointer */
  #define DMA0_TEE_ALIAS2                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS2_BASE)
  /** Peripheral DMA0_TEE_ALIAS2 base pointer */
  #define DMA0_TEE_ALIAS2_NS                       ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS2_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS3 base address */
  #define DMA0_TEE_ALIAS3_BASE                     (0x50083000u)
  /** Peripheral DMA0_TEE_ALIAS3 base address */
  #define DMA0_TEE_ALIAS3_BASE_NS                  (0x40083000u)
  /** Peripheral DMA0_TEE_ALIAS3 base pointer */
  #define DMA0_TEE_ALIAS3                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS3_BASE)
  /** Peripheral DMA0_TEE_ALIAS3 base pointer */
  #define DMA0_TEE_ALIAS3_NS                       ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS3_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS4 base address */
  #define DMA0_TEE_ALIAS4_BASE                     (0x50084000u)
  /** Peripheral DMA0_TEE_ALIAS4 base address */
  #define DMA0_TEE_ALIAS4_BASE_NS                  (0x40084000u)
  /** Peripheral DMA0_TEE_ALIAS4 base pointer */
  #define DMA0_TEE_ALIAS4                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS4_BASE)
  /** Peripheral DMA0_TEE_ALIAS4 base pointer */
  #define DMA0_TEE_ALIAS4_NS                       ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS4_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS5 base address */
  #define DMA0_TEE_ALIAS5_BASE                     (0x50085000u)
  /** Peripheral DMA0_TEE_ALIAS5 base address */
  #define DMA0_TEE_ALIAS5_BASE_NS                  (0x40085000u)
  /** Peripheral DMA0_TEE_ALIAS5 base pointer */
  #define DMA0_TEE_ALIAS5                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS5_BASE)
  /** Peripheral DMA0_TEE_ALIAS5 base pointer */
  #define DMA0_TEE_ALIAS5_NS                       ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS5_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS6 base address */
  #define DMA0_TEE_ALIAS6_BASE                     (0x50086000u)
  /** Peripheral DMA0_TEE_ALIAS6 base address */
  #define DMA0_TEE_ALIAS6_BASE_NS                  (0x40086000u)
  /** Peripheral DMA0_TEE_ALIAS6 base pointer */
  #define DMA0_TEE_ALIAS6                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS6_BASE)
  /** Peripheral DMA0_TEE_ALIAS6 base pointer */
  #define DMA0_TEE_ALIAS6_NS                       ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS6_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS7 base address */
  #define DMA0_TEE_ALIAS7_BASE                     (0x50087000u)
  /** Peripheral DMA0_TEE_ALIAS7 base address */
  #define DMA0_TEE_ALIAS7_BASE_NS                  (0x40087000u)
  /** Peripheral DMA0_TEE_ALIAS7 base pointer */
  #define DMA0_TEE_ALIAS7                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS7_BASE)
  /** Peripheral DMA0_TEE_ALIAS7 base pointer */
  #define DMA0_TEE_ALIAS7_NS                       ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS7_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS8 base address */
  #define DMA0_TEE_ALIAS8_BASE                     (0x50088000u)
  /** Peripheral DMA0_TEE_ALIAS8 base address */
  #define DMA0_TEE_ALIAS8_BASE_NS                  (0x40088000u)
  /** Peripheral DMA0_TEE_ALIAS8 base pointer */
  #define DMA0_TEE_ALIAS8                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS8_BASE)
  /** Peripheral DMA0_TEE_ALIAS8 base pointer */
  #define DMA0_TEE_ALIAS8_NS                       ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS8_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS9 base address */
  #define DMA0_TEE_ALIAS9_BASE                     (0x50089000u)
  /** Peripheral DMA0_TEE_ALIAS9 base address */
  #define DMA0_TEE_ALIAS9_BASE_NS                  (0x40089000u)
  /** Peripheral DMA0_TEE_ALIAS9 base pointer */
  #define DMA0_TEE_ALIAS9                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS9_BASE)
  /** Peripheral DMA0_TEE_ALIAS9 base pointer */
  #define DMA0_TEE_ALIAS9_NS                       ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS9_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS10 base address */
  #define DMA0_TEE_ALIAS10_BASE                    (0x5008A000u)
  /** Peripheral DMA0_TEE_ALIAS10 base address */
  #define DMA0_TEE_ALIAS10_BASE_NS                 (0x4008A000u)
  /** Peripheral DMA0_TEE_ALIAS10 base pointer */
  #define DMA0_TEE_ALIAS10                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS10_BASE)
  /** Peripheral DMA0_TEE_ALIAS10 base pointer */
  #define DMA0_TEE_ALIAS10_NS                      ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS10_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS11 base address */
  #define DMA0_TEE_ALIAS11_BASE                    (0x5008B000u)
  /** Peripheral DMA0_TEE_ALIAS11 base address */
  #define DMA0_TEE_ALIAS11_BASE_NS                 (0x4008B000u)
  /** Peripheral DMA0_TEE_ALIAS11 base pointer */
  #define DMA0_TEE_ALIAS11                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS11_BASE)
  /** Peripheral DMA0_TEE_ALIAS11 base pointer */
  #define DMA0_TEE_ALIAS11_NS                      ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS11_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS12 base address */
  #define DMA0_TEE_ALIAS12_BASE                    (0x5008C000u)
  /** Peripheral DMA0_TEE_ALIAS12 base address */
  #define DMA0_TEE_ALIAS12_BASE_NS                 (0x4008C000u)
  /** Peripheral DMA0_TEE_ALIAS12 base pointer */
  #define DMA0_TEE_ALIAS12                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS12_BASE)
  /** Peripheral DMA0_TEE_ALIAS12 base pointer */
  #define DMA0_TEE_ALIAS12_NS                      ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS12_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS13 base address */
  #define DMA0_TEE_ALIAS13_BASE                    (0x5008D000u)
  /** Peripheral DMA0_TEE_ALIAS13 base address */
  #define DMA0_TEE_ALIAS13_BASE_NS                 (0x4008D000u)
  /** Peripheral DMA0_TEE_ALIAS13 base pointer */
  #define DMA0_TEE_ALIAS13                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS13_BASE)
  /** Peripheral DMA0_TEE_ALIAS13 base pointer */
  #define DMA0_TEE_ALIAS13_NS                      ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS13_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS14 base address */
  #define DMA0_TEE_ALIAS14_BASE                    (0x5008E000u)
  /** Peripheral DMA0_TEE_ALIAS14 base address */
  #define DMA0_TEE_ALIAS14_BASE_NS                 (0x4008E000u)
  /** Peripheral DMA0_TEE_ALIAS14 base pointer */
  #define DMA0_TEE_ALIAS14                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS14_BASE)
  /** Peripheral DMA0_TEE_ALIAS14 base pointer */
  #define DMA0_TEE_ALIAS14_NS                      ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS14_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS15 base address */
  #define DMA0_TEE_ALIAS15_BASE                    (0x5008F000u)
  /** Peripheral DMA0_TEE_ALIAS15 base address */
  #define DMA0_TEE_ALIAS15_BASE_NS                 (0x4008F000u)
  /** Peripheral DMA0_TEE_ALIAS15 base pointer */
  #define DMA0_TEE_ALIAS15                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS15_BASE)
  /** Peripheral DMA0_TEE_ALIAS15 base pointer */
  #define DMA0_TEE_ALIAS15_NS                      ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS15_BASE_NS)
  /** Peripheral DMA0_TEE_ALIAS16 base address */
  #define DMA0_TEE_ALIAS16_BASE                    (0x50090000u)
  /** Peripheral DMA0_TEE_ALIAS16 base address */
  #define DMA0_TEE_ALIAS16_BASE_NS                 (0x40090000u)
  /** Peripheral DMA0_TEE_ALIAS16 base pointer */
  #define DMA0_TEE_ALIAS16                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS16_BASE)
  /** Peripheral DMA0_TEE_ALIAS16 base pointer */
  #define DMA0_TEE_ALIAS16_NS                      ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS16_BASE_NS)
  /** Array initializer of DMA0_TEE_ALIAS peripheral base addresses */
  #define DMA0_TEE_ALIAS_BASE_ADDRS                { DMA0_TEE_ALIAS0_BASE, DMA0_TEE_ALIAS1_BASE, DMA0_TEE_ALIAS2_BASE, DMA0_TEE_ALIAS3_BASE, DMA0_TEE_ALIAS4_BASE, DMA0_TEE_ALIAS5_BASE, DMA0_TEE_ALIAS6_BASE, DMA0_TEE_ALIAS7_BASE, DMA0_TEE_ALIAS8_BASE, DMA0_TEE_ALIAS9_BASE, DMA0_TEE_ALIAS10_BASE, DMA0_TEE_ALIAS11_BASE, DMA0_TEE_ALIAS12_BASE, DMA0_TEE_ALIAS13_BASE, DMA0_TEE_ALIAS14_BASE, DMA0_TEE_ALIAS15_BASE, DMA0_TEE_ALIAS16_BASE }
  /** Array initializer of DMA0_TEE_ALIAS peripheral base pointers */
  #define DMA0_TEE_ALIAS_BASE_PTRS                 { DMA0_TEE_ALIAS0, DMA0_TEE_ALIAS1, DMA0_TEE_ALIAS2, DMA0_TEE_ALIAS3, DMA0_TEE_ALIAS4, DMA0_TEE_ALIAS5, DMA0_TEE_ALIAS6, DMA0_TEE_ALIAS7, DMA0_TEE_ALIAS8, DMA0_TEE_ALIAS9, DMA0_TEE_ALIAS10, DMA0_TEE_ALIAS11, DMA0_TEE_ALIAS12, DMA0_TEE_ALIAS13, DMA0_TEE_ALIAS14, DMA0_TEE_ALIAS15, DMA0_TEE_ALIAS16 }
  /** Array initializer of DMA0_TEE_ALIAS peripheral base addresses */
  #define DMA0_TEE_ALIAS_BASE_ADDRS_NS             { DMA0_TEE_ALIAS0_BASE_NS, DMA0_TEE_ALIAS1_BASE_NS, DMA0_TEE_ALIAS2_BASE_NS, DMA0_TEE_ALIAS3_BASE_NS, DMA0_TEE_ALIAS4_BASE_NS, DMA0_TEE_ALIAS5_BASE_NS, DMA0_TEE_ALIAS6_BASE_NS, DMA0_TEE_ALIAS7_BASE_NS, DMA0_TEE_ALIAS8_BASE_NS, DMA0_TEE_ALIAS9_BASE_NS, DMA0_TEE_ALIAS10_BASE_NS, DMA0_TEE_ALIAS11_BASE_NS, DMA0_TEE_ALIAS12_BASE_NS, DMA0_TEE_ALIAS13_BASE_NS, DMA0_TEE_ALIAS14_BASE_NS, DMA0_TEE_ALIAS15_BASE_NS, DMA0_TEE_ALIAS16_BASE_NS }
  /** Array initializer of DMA0_TEE_ALIAS peripheral base pointers */
  #define DMA0_TEE_ALIAS_BASE_PTRS_NS              { DMA0_TEE_ALIAS0_NS, DMA0_TEE_ALIAS1_NS, DMA0_TEE_ALIAS2_NS, DMA0_TEE_ALIAS3_NS, DMA0_TEE_ALIAS4_NS, DMA0_TEE_ALIAS5_NS, DMA0_TEE_ALIAS6_NS, DMA0_TEE_ALIAS7_NS, DMA0_TEE_ALIAS8_NS, DMA0_TEE_ALIAS9_NS, DMA0_TEE_ALIAS10_NS, DMA0_TEE_ALIAS11_NS, DMA0_TEE_ALIAS12_NS, DMA0_TEE_ALIAS13_NS, DMA0_TEE_ALIAS14_NS, DMA0_TEE_ALIAS15_NS, DMA0_TEE_ALIAS16_NS }
#else
  /** Peripheral DMA0_TEE_ALIAS0 base address */
  #define DMA0_TEE_ALIAS0_BASE                     (0x40080000u)
  /** Peripheral DMA0_TEE_ALIAS0 base pointer */
  #define DMA0_TEE_ALIAS0                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS0_BASE)
  /** Peripheral DMA0_TEE_ALIAS1 base address */
  #define DMA0_TEE_ALIAS1_BASE                     (0x40081000u)
  /** Peripheral DMA0_TEE_ALIAS1 base pointer */
  #define DMA0_TEE_ALIAS1                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS1_BASE)
  /** Peripheral DMA0_TEE_ALIAS2 base address */
  #define DMA0_TEE_ALIAS2_BASE                     (0x40082000u)
  /** Peripheral DMA0_TEE_ALIAS2 base pointer */
  #define DMA0_TEE_ALIAS2                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS2_BASE)
  /** Peripheral DMA0_TEE_ALIAS3 base address */
  #define DMA0_TEE_ALIAS3_BASE                     (0x40083000u)
  /** Peripheral DMA0_TEE_ALIAS3 base pointer */
  #define DMA0_TEE_ALIAS3                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS3_BASE)
  /** Peripheral DMA0_TEE_ALIAS4 base address */
  #define DMA0_TEE_ALIAS4_BASE                     (0x40084000u)
  /** Peripheral DMA0_TEE_ALIAS4 base pointer */
  #define DMA0_TEE_ALIAS4                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS4_BASE)
  /** Peripheral DMA0_TEE_ALIAS5 base address */
  #define DMA0_TEE_ALIAS5_BASE                     (0x40085000u)
  /** Peripheral DMA0_TEE_ALIAS5 base pointer */
  #define DMA0_TEE_ALIAS5                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS5_BASE)
  /** Peripheral DMA0_TEE_ALIAS6 base address */
  #define DMA0_TEE_ALIAS6_BASE                     (0x40086000u)
  /** Peripheral DMA0_TEE_ALIAS6 base pointer */
  #define DMA0_TEE_ALIAS6                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS6_BASE)
  /** Peripheral DMA0_TEE_ALIAS7 base address */
  #define DMA0_TEE_ALIAS7_BASE                     (0x40087000u)
  /** Peripheral DMA0_TEE_ALIAS7 base pointer */
  #define DMA0_TEE_ALIAS7                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS7_BASE)
  /** Peripheral DMA0_TEE_ALIAS8 base address */
  #define DMA0_TEE_ALIAS8_BASE                     (0x40088000u)
  /** Peripheral DMA0_TEE_ALIAS8 base pointer */
  #define DMA0_TEE_ALIAS8                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS8_BASE)
  /** Peripheral DMA0_TEE_ALIAS9 base address */
  #define DMA0_TEE_ALIAS9_BASE                     (0x40089000u)
  /** Peripheral DMA0_TEE_ALIAS9 base pointer */
  #define DMA0_TEE_ALIAS9                          ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS9_BASE)
  /** Peripheral DMA0_TEE_ALIAS10 base address */
  #define DMA0_TEE_ALIAS10_BASE                    (0x4008A000u)
  /** Peripheral DMA0_TEE_ALIAS10 base pointer */
  #define DMA0_TEE_ALIAS10                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS10_BASE)
  /** Peripheral DMA0_TEE_ALIAS11 base address */
  #define DMA0_TEE_ALIAS11_BASE                    (0x4008B000u)
  /** Peripheral DMA0_TEE_ALIAS11 base pointer */
  #define DMA0_TEE_ALIAS11                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS11_BASE)
  /** Peripheral DMA0_TEE_ALIAS12 base address */
  #define DMA0_TEE_ALIAS12_BASE                    (0x4008C000u)
  /** Peripheral DMA0_TEE_ALIAS12 base pointer */
  #define DMA0_TEE_ALIAS12                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS12_BASE)
  /** Peripheral DMA0_TEE_ALIAS13 base address */
  #define DMA0_TEE_ALIAS13_BASE                    (0x4008D000u)
  /** Peripheral DMA0_TEE_ALIAS13 base pointer */
  #define DMA0_TEE_ALIAS13                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS13_BASE)
  /** Peripheral DMA0_TEE_ALIAS14 base address */
  #define DMA0_TEE_ALIAS14_BASE                    (0x4008E000u)
  /** Peripheral DMA0_TEE_ALIAS14 base pointer */
  #define DMA0_TEE_ALIAS14                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS14_BASE)
  /** Peripheral DMA0_TEE_ALIAS15 base address */
  #define DMA0_TEE_ALIAS15_BASE                    (0x4008F000u)
  /** Peripheral DMA0_TEE_ALIAS15 base pointer */
  #define DMA0_TEE_ALIAS15                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS15_BASE)
  /** Peripheral DMA0_TEE_ALIAS16 base address */
  #define DMA0_TEE_ALIAS16_BASE                    (0x40090000u)
  /** Peripheral DMA0_TEE_ALIAS16 base pointer */
  #define DMA0_TEE_ALIAS16                         ((DMA0_TEE_ALIAS_Type *)DMA0_TEE_ALIAS16_BASE)
  /** Array initializer of DMA0_TEE_ALIAS peripheral base addresses */
  #define DMA0_TEE_ALIAS_BASE_ADDRS                { DMA0_TEE_ALIAS0_BASE, DMA0_TEE_ALIAS1_BASE, DMA0_TEE_ALIAS2_BASE, DMA0_TEE_ALIAS3_BASE, DMA0_TEE_ALIAS4_BASE, DMA0_TEE_ALIAS5_BASE, DMA0_TEE_ALIAS6_BASE, DMA0_TEE_ALIAS7_BASE, DMA0_TEE_ALIAS8_BASE, DMA0_TEE_ALIAS9_BASE, DMA0_TEE_ALIAS10_BASE, DMA0_TEE_ALIAS11_BASE, DMA0_TEE_ALIAS12_BASE, DMA0_TEE_ALIAS13_BASE, DMA0_TEE_ALIAS14_BASE, DMA0_TEE_ALIAS15_BASE, DMA0_TEE_ALIAS16_BASE }
  /** Array initializer of DMA0_TEE_ALIAS peripheral base pointers */
  #define DMA0_TEE_ALIAS_BASE_PTRS                 { DMA0_TEE_ALIAS0, DMA0_TEE_ALIAS1, DMA0_TEE_ALIAS2, DMA0_TEE_ALIAS3, DMA0_TEE_ALIAS4, DMA0_TEE_ALIAS5, DMA0_TEE_ALIAS6, DMA0_TEE_ALIAS7, DMA0_TEE_ALIAS8, DMA0_TEE_ALIAS9, DMA0_TEE_ALIAS10, DMA0_TEE_ALIAS11, DMA0_TEE_ALIAS12, DMA0_TEE_ALIAS13, DMA0_TEE_ALIAS14, DMA0_TEE_ALIAS15, DMA0_TEE_ALIAS16 }
#endif

/*!
 * @}
 */ /* end of group DMA0_TEE_ALIAS_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DMA1_TEE_ALIAS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA1_TEE_ALIAS_Peripheral_Access_Layer DMA1_TEE_ALIAS Peripheral Access Layer
 * @{
 */

/** DMA1_TEE_ALIAS - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4092];
       uint32_t RESERVED;                          /**< Reserved., offset: 0xFFC */
} DMA1_TEE_ALIAS_Type;

/* ----------------------------------------------------------------------------
   -- DMA1_TEE_ALIAS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA1_TEE_ALIAS_Register_Masks DMA1_TEE_ALIAS Register Masks
 * @{
 */


/*!
 * @}
 */ /* end of group DMA1_TEE_ALIAS_Register_Masks */


