RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN236/MCXN236/MCXN236.h
/* DMA1_TEE_ALIAS - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral DMA1_TEE_ALIAS0 base address */
  #define DMA1_TEE_ALIAS0_BASE                     (0x500A0000u)
  /** Peripheral DMA1_TEE_ALIAS0 base address */
  #define DMA1_TEE_ALIAS0_BASE_NS                  (0x400A0000u)
  /** Peripheral DMA1_TEE_ALIAS0 base pointer */
  #define DMA1_TEE_ALIAS0                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS0_BASE)
  /** Peripheral DMA1_TEE_ALIAS0 base pointer */
  #define DMA1_TEE_ALIAS0_NS                       ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS0_BASE_NS)
  /** Peripheral DMA1_TEE_ALIAS1 base address */
  #define DMA1_TEE_ALIAS1_BASE                     (0x500A1000u)
  /** Peripheral DMA1_TEE_ALIAS1 base address */
  #define DMA1_TEE_ALIAS1_BASE_NS                  (0x400A1000u)
  /** Peripheral DMA1_TEE_ALIAS1 base pointer */
  #define DMA1_TEE_ALIAS1                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS1_BASE)
  /** Peripheral DMA1_TEE_ALIAS1 base pointer */
  #define DMA1_TEE_ALIAS1_NS                       ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS1_BASE_NS)
  /** Peripheral DMA1_TEE_ALIAS2 base address */
  #define DMA1_TEE_ALIAS2_BASE                     (0x500A2000u)
  /** Peripheral DMA1_TEE_ALIAS2 base address */
  #define DMA1_TEE_ALIAS2_BASE_NS                  (0x400A2000u)
  /** Peripheral DMA1_TEE_ALIAS2 base pointer */
  #define DMA1_TEE_ALIAS2                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS2_BASE)
  /** Peripheral DMA1_TEE_ALIAS2 base pointer */
  #define DMA1_TEE_ALIAS2_NS                       ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS2_BASE_NS)
  /** Peripheral DMA1_TEE_ALIAS3 base address */
  #define DMA1_TEE_ALIAS3_BASE                     (0x500A3000u)
  /** Peripheral DMA1_TEE_ALIAS3 base address */
  #define DMA1_TEE_ALIAS3_BASE_NS                  (0x400A3000u)
  /** Peripheral DMA1_TEE_ALIAS3 base pointer */
  #define DMA1_TEE_ALIAS3                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS3_BASE)
  /** Peripheral DMA1_TEE_ALIAS3 base pointer */
  #define DMA1_TEE_ALIAS3_NS                       ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS3_BASE_NS)
  /** Peripheral DMA1_TEE_ALIAS4 base address */
  #define DMA1_TEE_ALIAS4_BASE                     (0x500A4000u)
  /** Peripheral DMA1_TEE_ALIAS4 base address */
  #define DMA1_TEE_ALIAS4_BASE_NS                  (0x400A4000u)
  /** Peripheral DMA1_TEE_ALIAS4 base pointer */
  #define DMA1_TEE_ALIAS4                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS4_BASE)
  /** Peripheral DMA1_TEE_ALIAS4 base pointer */
  #define DMA1_TEE_ALIAS4_NS                       ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS4_BASE_NS)
  /** Peripheral DMA1_TEE_ALIAS5 base address */
  #define DMA1_TEE_ALIAS5_BASE                     (0x500A5000u)
  /** Peripheral DMA1_TEE_ALIAS5 base address */
  #define DMA1_TEE_ALIAS5_BASE_NS                  (0x400A5000u)
  /** Peripheral DMA1_TEE_ALIAS5 base pointer */
  #define DMA1_TEE_ALIAS5                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS5_BASE)
  /** Peripheral DMA1_TEE_ALIAS5 base pointer */
  #define DMA1_TEE_ALIAS5_NS                       ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS5_BASE_NS)
  /** Peripheral DMA1_TEE_ALIAS6 base address */
  #define DMA1_TEE_ALIAS6_BASE                     (0x500A6000u)
  /** Peripheral DMA1_TEE_ALIAS6 base address */
  #define DMA1_TEE_ALIAS6_BASE_NS                  (0x400A6000u)
  /** Peripheral DMA1_TEE_ALIAS6 base pointer */
  #define DMA1_TEE_ALIAS6                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS6_BASE)
  /** Peripheral DMA1_TEE_ALIAS6 base pointer */
  #define DMA1_TEE_ALIAS6_NS                       ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS6_BASE_NS)
  /** Peripheral DMA1_TEE_ALIAS7 base address */
  #define DMA1_TEE_ALIAS7_BASE                     (0x500A7000u)
  /** Peripheral DMA1_TEE_ALIAS7 base address */
  #define DMA1_TEE_ALIAS7_BASE_NS                  (0x400A7000u)
  /** Peripheral DMA1_TEE_ALIAS7 base pointer */
  #define DMA1_TEE_ALIAS7                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS7_BASE)
  /** Peripheral DMA1_TEE_ALIAS7 base pointer */
  #define DMA1_TEE_ALIAS7_NS                       ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS7_BASE_NS)
  /** Peripheral DMA1_TEE_ALIAS8 base address */
  #define DMA1_TEE_ALIAS8_BASE                     (0x500A8000u)
  /** Peripheral DMA1_TEE_ALIAS8 base address */
  #define DMA1_TEE_ALIAS8_BASE_NS                  (0x400A8000u)
  /** Peripheral DMA1_TEE_ALIAS8 base pointer */
  #define DMA1_TEE_ALIAS8                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS8_BASE)
  /** Peripheral DMA1_TEE_ALIAS8 base pointer */
  #define DMA1_TEE_ALIAS8_NS                       ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS8_BASE_NS)
  /** Array initializer of DMA1_TEE_ALIAS peripheral base addresses */
  #define DMA1_TEE_ALIAS_BASE_ADDRS                { DMA1_TEE_ALIAS0_BASE, DMA1_TEE_ALIAS1_BASE, DMA1_TEE_ALIAS2_BASE, DMA1_TEE_ALIAS3_BASE, DMA1_TEE_ALIAS4_BASE, DMA1_TEE_ALIAS5_BASE, DMA1_TEE_ALIAS6_BASE, DMA1_TEE_ALIAS7_BASE, DMA1_TEE_ALIAS8_BASE }
  /** Array initializer of DMA1_TEE_ALIAS peripheral base pointers */
  #define DMA1_TEE_ALIAS_BASE_PTRS                 { DMA1_TEE_ALIAS0, DMA1_TEE_ALIAS1, DMA1_TEE_ALIAS2, DMA1_TEE_ALIAS3, DMA1_TEE_ALIAS4, DMA1_TEE_ALIAS5, DMA1_TEE_ALIAS6, DMA1_TEE_ALIAS7, DMA1_TEE_ALIAS8 }
  /** Array initializer of DMA1_TEE_ALIAS peripheral base addresses */
  #define DMA1_TEE_ALIAS_BASE_ADDRS_NS             { DMA1_TEE_ALIAS0_BASE_NS, DMA1_TEE_ALIAS1_BASE_NS, DMA1_TEE_ALIAS2_BASE_NS, DMA1_TEE_ALIAS3_BASE_NS, DMA1_TEE_ALIAS4_BASE_NS, DMA1_TEE_ALIAS5_BASE_NS, DMA1_TEE_ALIAS6_BASE_NS, DMA1_TEE_ALIAS7_BASE_NS, DMA1_TEE_ALIAS8_BASE_NS }
  /** Array initializer of DMA1_TEE_ALIAS peripheral base pointers */
  #define DMA1_TEE_ALIAS_BASE_PTRS_NS              { DMA1_TEE_ALIAS0_NS, DMA1_TEE_ALIAS1_NS, DMA1_TEE_ALIAS2_NS, DMA1_TEE_ALIAS3_NS, DMA1_TEE_ALIAS4_NS, DMA1_TEE_ALIAS5_NS, DMA1_TEE_ALIAS6_NS, DMA1_TEE_ALIAS7_NS, DMA1_TEE_ALIAS8_NS }
#else
  /** Peripheral DMA1_TEE_ALIAS0 base address */
  #define DMA1_TEE_ALIAS0_BASE                     (0x400A0000u)
  /** Peripheral DMA1_TEE_ALIAS0 base pointer */
  #define DMA1_TEE_ALIAS0                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS0_BASE)
  /** Peripheral DMA1_TEE_ALIAS1 base address */
  #define DMA1_TEE_ALIAS1_BASE                     (0x400A1000u)
  /** Peripheral DMA1_TEE_ALIAS1 base pointer */
  #define DMA1_TEE_ALIAS1                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS1_BASE)
  /** Peripheral DMA1_TEE_ALIAS2 base address */
  #define DMA1_TEE_ALIAS2_BASE                     (0x400A2000u)
  /** Peripheral DMA1_TEE_ALIAS2 base pointer */
  #define DMA1_TEE_ALIAS2                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS2_BASE)
  /** Peripheral DMA1_TEE_ALIAS3 base address */
  #define DMA1_TEE_ALIAS3_BASE                     (0x400A3000u)
  /** Peripheral DMA1_TEE_ALIAS3 base pointer */
  #define DMA1_TEE_ALIAS3                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS3_BASE)
  /** Peripheral DMA1_TEE_ALIAS4 base address */
  #define DMA1_TEE_ALIAS4_BASE                     (0x400A4000u)
  /** Peripheral DMA1_TEE_ALIAS4 base pointer */
  #define DMA1_TEE_ALIAS4                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS4_BASE)
  /** Peripheral DMA1_TEE_ALIAS5 base address */
  #define DMA1_TEE_ALIAS5_BASE                     (0x400A5000u)
  /** Peripheral DMA1_TEE_ALIAS5 base pointer */
  #define DMA1_TEE_ALIAS5                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS5_BASE)
  /** Peripheral DMA1_TEE_ALIAS6 base address */
  #define DMA1_TEE_ALIAS6_BASE                     (0x400A6000u)
  /** Peripheral DMA1_TEE_ALIAS6 base pointer */
  #define DMA1_TEE_ALIAS6                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS6_BASE)
  /** Peripheral DMA1_TEE_ALIAS7 base address */
  #define DMA1_TEE_ALIAS7_BASE                     (0x400A7000u)
  /** Peripheral DMA1_TEE_ALIAS7 base pointer */
  #define DMA1_TEE_ALIAS7                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS7_BASE)
  /** Peripheral DMA1_TEE_ALIAS8 base address */
  #define DMA1_TEE_ALIAS8_BASE                     (0x400A8000u)
  /** Peripheral DMA1_TEE_ALIAS8 base pointer */
  #define DMA1_TEE_ALIAS8                          ((DMA1_TEE_ALIAS_Type *)DMA1_TEE_ALIAS8_BASE)
  /** Array initializer of DMA1_TEE_ALIAS peripheral base addresses */
  #define DMA1_TEE_ALIAS_BASE_ADDRS                { DMA1_TEE_ALIAS0_BASE, DMA1_TEE_ALIAS1_BASE, DMA1_TEE_ALIAS2_BASE, DMA1_TEE_ALIAS3_BASE, DMA1_TEE_ALIAS4_BASE, DMA1_TEE_ALIAS5_BASE, DMA1_TEE_ALIAS6_BASE, DMA1_TEE_ALIAS7_BASE, DMA1_TEE_ALIAS8_BASE }
  /** Array initializer of DMA1_TEE_ALIAS peripheral base pointers */
  #define DMA1_TEE_ALIAS_BASE_PTRS                 { DMA1_TEE_ALIAS0, DMA1_TEE_ALIAS1, DMA1_TEE_ALIAS2, DMA1_TEE_ALIAS3, DMA1_TEE_ALIAS4, DMA1_TEE_ALIAS5, DMA1_TEE_ALIAS6, DMA1_TEE_ALIAS7, DMA1_TEE_ALIAS8 }
#endif

/*!
 * @}
 */ /* end of group DMA1_TEE_ALIAS_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- EIM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EIM_Peripheral_Access_Layer EIM Peripheral Access Layer
 * @{
 */

/** EIM - Register Layout Typedef */
typedef struct {
  __IO uint32_t EIMCR;                             /**< Error Injection Module Configuration Register, offset: 0x0 */
  __IO uint32_t EICHEN;                            /**< Error Injection Channel Enable register, offset: 0x4 */
       uint8_t RESERVED_0[248];
  __IO uint32_t EICHD0_WORD0;                      /**< Error Injection Channel Descriptor 0, Word0, offset: 0x100 */
  __IO uint32_t EICHD0_WORD1;                      /**< Error Injection Channel Descriptor 0, Word1, offset: 0x104 */
       uint8_t RESERVED_1[56];
  __IO uint32_t EICHD1_WORD0;                      /**< Error Injection Channel Descriptor 1, Word0, offset: 0x140 */
  __IO uint32_t EICHD1_WORD1;                      /**< Error Injection Channel Descriptor 1, Word1, offset: 0x144 */
       uint8_t RESERVED_2[56];
  __IO uint32_t EICHD2_WORD0;                      /**< Error Injection Channel Descriptor 2, Word0, offset: 0x180 */
  __IO uint32_t EICHD2_WORD1;                      /**< Error Injection Channel Descriptor 2, Word1, offset: 0x184 */
       uint8_t RESERVED_3[56];
  __IO uint32_t EICHD3_WORD0;                      /**< Error Injection Channel Descriptor 3, Word0, offset: 0x1C0 */
  __IO uint32_t EICHD3_WORD1;                      /**< Error Injection Channel Descriptor 3, Word1, offset: 0x1C4 */
       uint8_t RESERVED_4[56];
  __IO uint32_t EICHD4_WORD0;                      /**< Error Injection Channel Descriptor 4, Word0, offset: 0x200 */
  __IO uint32_t EICHD4_WORD1;                      /**< Error Injection Channel Descriptor 4, Word1, offset: 0x204 */
       uint8_t RESERVED_5[56];
  __IO uint32_t EICHD5_WORD0;                      /**< Error Injection Channel Descriptor 5, Word0, offset: 0x240 */
  __IO uint32_t EICHD5_WORD1;                      /**< Error Injection Channel Descriptor 5, Word1, offset: 0x244 */
       uint8_t RESERVED_6[56];
  __IO uint32_t EICHD6_WORD0;                      /**< Error Injection Channel Descriptor 6, Word0, offset: 0x280 */
  __IO uint32_t EICHD6_WORD1;                      /**< Error Injection Channel Descriptor 6, Word1, offset: 0x284 */
       uint8_t RESERVED_7[56];
  __IO uint32_t EICHD7_WORD0;                      /**< Error Injection Channel Descriptor 7, Word0, offset: 0x2C0 */
  __IO uint32_t EICHD7_WORD1;                      /**< Error Injection Channel Descriptor 7, Word1, offset: 0x2C4 */
       uint8_t RESERVED_8[56];
  __IO uint32_t EICHD8_WORD0;                      /**< Error Injection Channel Descriptor 8, Word0, offset: 0x300 */
  __IO uint32_t EICHD8_WORD1;                      /**< Error Injection Channel Descriptor 8, Word1, offset: 0x304 */
} EIM_Type;

/* ----------------------------------------------------------------------------
   -- EIM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EIM_Register_Masks EIM Register Masks
 * @{
 */

