RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN236/MCXN236/MCXN236.h
#define OTPC_SR_BUSY_MASK                        (0x1U)
#define OTPC_SR_BUSY_SHIFT                       (0U)
/*! BUSY - Busy status
 *  0b0..Not busy (transaction complete)
 *  0b1..Busy
 */
#define OTPC_SR_BUSY(x)                          (((uint32_t)(((uint32_t)(x)) << OTPC_SR_BUSY_SHIFT)) & OTPC_SR_BUSY_MASK)

#define OTPC_SR_ERROR_MASK                       (0x2U)
#define OTPC_SR_ERROR_SHIFT                      (1U)
/*! ERROR - Error flag
 *  0b0..No error
 *  0b1..Error
 */
#define OTPC_SR_ERROR(x)                         (((uint32_t)(((uint32_t)(x)) << OTPC_SR_ERROR_SHIFT)) & OTPC_SR_ERROR_MASK)

#define OTPC_SR_ECC_SF_MASK                      (0x4U)
#define OTPC_SR_ECC_SF_SHIFT                     (2U)
/*! ECC_SF - ECC single fault
 *  0b0..No fault
 *  0b1..Fault
 */
#define OTPC_SR_ECC_SF(x)                        (((uint32_t)(((uint32_t)(x)) << OTPC_SR_ECC_SF_SHIFT)) & OTPC_SR_ECC_SF_MASK)

#define OTPC_SR_ECC_DF_MASK                      (0x8U)
#define OTPC_SR_ECC_DF_SHIFT                     (3U)
/*! ECC_DF - ECC double fault
 *  0b0..No fault
 *  0b1..Fault
 */
#define OTPC_SR_ECC_DF(x)                        (((uint32_t)(((uint32_t)(x)) << OTPC_SR_ECC_DF_SHIFT)) & OTPC_SR_ECC_DF_MASK)

#define OTPC_SR_TRI_F_MASK                       (0x10U)
#define OTPC_SR_TRI_F_SHIFT                      (4U)
/*! TRI_F - Triple voting fault
 *  0b0..No fault
 *  0b1..Fault
 */
#define OTPC_SR_TRI_F(x)                         (((uint32_t)(((uint32_t)(x)) << OTPC_SR_TRI_F_SHIFT)) & OTPC_SR_TRI_F_MASK)

#define OTPC_SR_RD_FUSE_LOCK_MASK                (0x100U)
#define OTPC_SR_RD_FUSE_LOCK_SHIFT               (8U)
/*! RD_FUSE_LOCK - Read fuse lock error
 *  0b0..No error
 *  0b1..Error
 */
#define OTPC_SR_RD_FUSE_LOCK(x)                  (((uint32_t)(((uint32_t)(x)) << OTPC_SR_RD_FUSE_LOCK_SHIFT)) & OTPC_SR_RD_FUSE_LOCK_MASK)

#define OTPC_SR_WR_FUSE_LOCK_MASK                (0x200U)
#define OTPC_SR_WR_FUSE_LOCK_SHIFT               (9U)
/*! WR_FUSE_LOCK - Write fuse lock error
 *  0b0..No error
 *  0b1..Error
 */
#define OTPC_SR_WR_FUSE_LOCK(x)                  (((uint32_t)(((uint32_t)(x)) << OTPC_SR_WR_FUSE_LOCK_SHIFT)) & OTPC_SR_WR_FUSE_LOCK_MASK)

#define OTPC_SR_RD_REG_LOCK_MASK                 (0x400U)
#define OTPC_SR_RD_REG_LOCK_SHIFT                (10U)
/*! RD_REG_LOCK - Read register lock error
 *  0b0..No error
 *  0b1..Error
 */
#define OTPC_SR_RD_REG_LOCK(x)                   (((uint32_t)(((uint32_t)(x)) << OTPC_SR_RD_REG_LOCK_SHIFT)) & OTPC_SR_RD_REG_LOCK_MASK)

#define OTPC_SR_WR_REG_LOCK_MASK                 (0x800U)
#define OTPC_SR_WR_REG_LOCK_SHIFT                (11U)
/*! WR_REG_LOCK - Write register lock error
 *  0b0..No error
 *  0b1..Error
 */
#define OTPC_SR_WR_REG_LOCK(x)                   (((uint32_t)(((uint32_t)(x)) << OTPC_SR_WR_REG_LOCK_SHIFT)) & OTPC_SR_WR_REG_LOCK_MASK)

#define OTPC_SR_WR_REG_BUSY_MASK                 (0x1000U)
#define OTPC_SR_WR_REG_BUSY_SHIFT                (12U)
/*! WR_REG_BUSY - Write register when busy error
 *  0b0..No error
 *  0b1..Error
 */
#define OTPC_SR_WR_REG_BUSY(x)                   (((uint32_t)(((uint32_t)(x)) << OTPC_SR_WR_REG_BUSY_SHIFT)) & OTPC_SR_WR_REG_BUSY_MASK)

#define OTPC_SR_WR_POWER_OFF_MASK                (0x2000U)
#define OTPC_SR_WR_POWER_OFF_SHIFT               (13U)
/*! WR_POWER_OFF - Write when power off error
 *  0b0..No error
 *  0b1..Error
 */
#define OTPC_SR_WR_POWER_OFF(x)                  (((uint32_t)(((uint32_t)(x)) << OTPC_SR_WR_POWER_OFF_SHIFT)) & OTPC_SR_WR_POWER_OFF_MASK)

#define OTPC_SR_FSM_MASK                         (0x10000U)
#define OTPC_SR_FSM_SHIFT                        (16U)
/*! FSM - Finite-state machine error
 *  0b0..No error
 *  0b1..Error
 */
#define OTPC_SR_FSM(x)                           (((uint32_t)(((uint32_t)(x)) << OTPC_SR_FSM_SHIFT)) & OTPC_SR_FSM_MASK)

#define OTPC_SR_FLC_MASK                         (0x20000U)
#define OTPC_SR_FLC_SHIFT                        (17U)
/*! FLC - Fuse load counter error
 *  0b0..No error
 *  0b1..Error
 */
#define OTPC_SR_FLC(x)                           (((uint32_t)(((uint32_t)(x)) << OTPC_SR_FLC_SHIFT)) & OTPC_SR_FLC_MASK)

#define OTPC_SR_ADC_MASK                         (0x40000U)
#define OTPC_SR_ADC_SHIFT                        (18U)
/*! ADC - Address and data compare error
 *  0b0..No error
 *  0b1..Error
 */
#define OTPC_SR_ADC(x)                           (((uint32_t)(((uint32_t)(x)) << OTPC_SR_ADC_SHIFT)) & OTPC_SR_ADC_MASK)

#define OTPC_SR_IRC_MASK                         (0x80000U)
#define OTPC_SR_IRC_SHIFT                        (19U)
/*! IRC - Inverted register compare error
 *  0b0..No error
 *  0b1..Error
 */
#define OTPC_SR_IRC(x)                           (((uint32_t)(((uint32_t)(x)) << OTPC_SR_IRC_SHIFT)) & OTPC_SR_IRC_MASK)

#define OTPC_SR_FSC_MASK                         (0x100000U)
#define OTPC_SR_FSC_SHIFT                        (20U)
/*! FSC - Fuse and shadow register compare error
 *  0b0..No error
 *  0b1..Error
 */
#define OTPC_SR_FSC(x)                           (((uint32_t)(((uint32_t)(x)) << OTPC_SR_FSC_SHIFT)) & OTPC_SR_FSC_MASK)
/*! @} */

/*! @name RWC - Read and Write Control */
/*! @{ */

#define OTPC_RWC_ADDR_MASK                       (0x7FU)
#define OTPC_RWC_ADDR_SHIFT                      (0U)
/*! ADDR - EFUSE address */
#define OTPC_RWC_ADDR(x)                         (((uint32_t)(((uint32_t)(x)) << OTPC_RWC_ADDR_SHIFT)) & OTPC_RWC_ADDR_MASK)

#define OTPC_RWC_WR_ALL1S_MASK                   (0x1000U)
#define OTPC_RWC_WR_ALL1S_SHIFT                  (12U)
/*! WR_ALL1S - Write all 1s
 *  0b0..Uses the WDATA value
 *  0b1..Writes all 1s
 */
#define OTPC_RWC_WR_ALL1S(x)                     (((uint32_t)(((uint32_t)(x)) << OTPC_RWC_WR_ALL1S_SHIFT)) & OTPC_RWC_WR_ALL1S_MASK)

#define OTPC_RWC_READ_EFUSE_MASK                 (0x2000U)
#define OTPC_RWC_READ_EFUSE_SHIFT                (13U)
/*! READ_EFUSE - Read EFUSE
 *  0b0..Starts program operation when the WR_UNLOCK value is 0x9527; otherwise, takes no action.
 *  0b1..Starts read operation
 */
#define OTPC_RWC_READ_EFUSE(x)                   (((uint32_t)(((uint32_t)(x)) << OTPC_RWC_READ_EFUSE_SHIFT)) & OTPC_RWC_READ_EFUSE_MASK)

#define OTPC_RWC_READ_UPDATE_MASK                (0x4000U)
#define OTPC_RWC_READ_UPDATE_SHIFT               (14U)
/*! READ_UPDATE - Read update
 *  0b0..Shadow register does not update
 *  0b1..Shadow register updates
 */
#define OTPC_RWC_READ_UPDATE(x)                  (((uint32_t)(((uint32_t)(x)) << OTPC_RWC_READ_UPDATE_SHIFT)) & OTPC_RWC_READ_UPDATE_MASK)

#define OTPC_RWC_WR_UNLOCK_MASK                  (0xFFFF0000U)
#define OTPC_RWC_WR_UNLOCK_SHIFT                 (16U)
/*! WR_UNLOCK - Write Unlock */
#define OTPC_RWC_WR_UNLOCK(x)                    (((uint32_t)(((uint32_t)(x)) << OTPC_RWC_WR_UNLOCK_SHIFT)) & OTPC_RWC_WR_UNLOCK_MASK)
/*! @} */

/*! @name RLC - Reload Control */
/*! @{ */

#define OTPC_RLC_RELOAD_SHADOWS_MASK             (0x1U)
#define OTPC_RLC_RELOAD_SHADOWS_SHIFT            (0U)
/*! RELOAD_SHADOWS - Reload shadow registers
 *  0b0..No action (when writing) or reload complete (when reading)
 *  0b1..Reload
 */
#define OTPC_RLC_RELOAD_SHADOWS(x)               (((uint32_t)(((uint32_t)(x)) << OTPC_RLC_RELOAD_SHADOWS_SHIFT)) & OTPC_RLC_RELOAD_SHADOWS_MASK)
/*! @} */

/*! @name PCR - Power Control */
/*! @{ */

#define OTPC_PCR_HVREQ_MASK                      (0x1U)
#define OTPC_PCR_HVREQ_SHIFT                     (0U)
/*! HVREQ - Strong switch request
 *  0b0..Turn off
 *  0b1..Turn on
 */
#define OTPC_PCR_HVREQ(x)                        (((uint32_t)(((uint32_t)(x)) << OTPC_PCR_HVREQ_SHIFT)) & OTPC_PCR_HVREQ_MASK)

#define OTPC_PCR_LVREQ_MASK                      (0x2U)
#define OTPC_PCR_LVREQ_SHIFT                     (1U)
/*! LVREQ - Weak switch request
 *  0b0..Turn off
 *  0b1..Turn on
 */
#define OTPC_PCR_LVREQ(x)                        (((uint32_t)(((uint32_t)(x)) << OTPC_PCR_LVREQ_SHIFT)) & OTPC_PCR_LVREQ_MASK)

#define OTPC_PCR_PDREQ_MASK                      (0x4U)
#define OTPC_PCR_PDREQ_SHIFT                     (2U)
/*! PDREQ - Power down request
 *  0b0..PD pin is set to low when OTPC is in idle state. It means EFUSE hardmacro is in standby mode. Idle state
 *       means OTPC is not in read and program modes.
 *  0b1..PD pin is set to high when OTPC is in idle state. It means EFUSE hardmacro is in power down mode.
 */
#define OTPC_PCR_PDREQ(x)                        (((uint32_t)(((uint32_t)(x)) << OTPC_PCR_PDREQ_SHIFT)) & OTPC_PCR_PDREQ_MASK)
/*! @} */

/*! @name WDATA - Write Data */
/*! @{ */

