RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN236/MCXN236/MCXN236.h
#define OTPC_WDATA_DAT_MASK                      (0xFFFFFFFFU)
#define OTPC_WDATA_DAT_SHIFT                     (0U)
/*! DAT - Write data */
#define OTPC_WDATA_DAT(x)                        (((uint32_t)(((uint32_t)(x)) << OTPC_WDATA_DAT_SHIFT)) & OTPC_WDATA_DAT_MASK)
/*! @} */

/*! @name RDATA - Read Data */
/*! @{ */

#define OTPC_RDATA_DAT_MASK                      (0xFFFFFFFFU)
#define OTPC_RDATA_DAT_SHIFT                     (0U)
/*! DAT - Read data */
#define OTPC_RDATA_DAT(x)                        (((uint32_t)(((uint32_t)(x)) << OTPC_RDATA_DAT_SHIFT)) & OTPC_RDATA_DAT_MASK)
/*! @} */

/*! @name TIMING1 - Timing1 */
/*! @{ */

#define OTPC_TIMING1_TADDR_MASK                  (0xFU)
#define OTPC_TIMING1_TADDR_SHIFT                 (0U)
/*! TADDR - Address to STROBE setup and hold time */
#define OTPC_TIMING1_TADDR(x)                    (((uint32_t)(((uint32_t)(x)) << OTPC_TIMING1_TADDR_SHIFT)) & OTPC_TIMING1_TADDR_MASK)

#define OTPC_TIMING1_TRELAX_MASK                 (0xF0U)
#define OTPC_TIMING1_TRELAX_SHIFT                (4U)
/*! TRELAX - CSB, PGENB and LOAD to STROBE setup and hold time */
#define OTPC_TIMING1_TRELAX(x)                   (((uint32_t)(((uint32_t)(x)) << OTPC_TIMING1_TRELAX_SHIFT)) & OTPC_TIMING1_TRELAX_MASK)

#define OTPC_TIMING1_TRD_MASK                    (0x3F00U)
#define OTPC_TIMING1_TRD_SHIFT                   (8U)
/*! TRD - Read strobe pulse width time */
#define OTPC_TIMING1_TRD(x)                      (((uint32_t)(((uint32_t)(x)) << OTPC_TIMING1_TRD_SHIFT)) & OTPC_TIMING1_TRD_MASK)

#define OTPC_TIMING1_TPS_MASK                    (0x3F0000U)
#define OTPC_TIMING1_TPS_SHIFT                   (16U)
/*! TPS - PS to CSB setup and hold time between power switch and chip select assertion */
#define OTPC_TIMING1_TPS(x)                      (((uint32_t)(((uint32_t)(x)) << OTPC_TIMING1_TPS_SHIFT)) & OTPC_TIMING1_TPS_MASK)

#define OTPC_TIMING1_TPD_MASK                    (0xFF000000U)
#define OTPC_TIMING1_TPD_SHIFT                   (24U)
/*! TPD - PD to CSB setup time between power down signal deassertion and chip select signal assertion */
#define OTPC_TIMING1_TPD(x)                      (((uint32_t)(((uint32_t)(x)) << OTPC_TIMING1_TPD_SHIFT)) & OTPC_TIMING1_TPD_MASK)
/*! @} */

/*! @name TIMING2 - Timing2 */
/*! @{ */

#define OTPC_TIMING2_TPGM_MASK                   (0xFFFU)
#define OTPC_TIMING2_TPGM_SHIFT                  (0U)
/*! TPGM - Typical program strobe pulse width time */
#define OTPC_TIMING2_TPGM(x)                     (((uint32_t)(((uint32_t)(x)) << OTPC_TIMING2_TPGM_SHIFT)) & OTPC_TIMING2_TPGM_MASK)
/*! @} */

/*! @name LOCK - Lock */
/*! @{ */

#define OTPC_LOCK_NXP_PART_CFG_LOCK_MASK         (0x7U)
#define OTPC_LOCK_NXP_PART_CFG_LOCK_SHIFT        (0U)
/*! NXP_PART_CFG_LOCK - NXP Part Config Lock */
#define OTPC_LOCK_NXP_PART_CFG_LOCK(x)           (((uint32_t)(((uint32_t)(x)) << OTPC_LOCK_NXP_PART_CFG_LOCK_SHIFT)) & OTPC_LOCK_NXP_PART_CFG_LOCK_MASK)

#define OTPC_LOCK_NXP_EXT_LOCK_MASK              (0x38U)
#define OTPC_LOCK_NXP_EXT_LOCK_SHIFT             (3U)
/*! NXP_EXT_LOCK - NXP EXT Lock */
#define OTPC_LOCK_NXP_EXT_LOCK(x)                (((uint32_t)(((uint32_t)(x)) << OTPC_LOCK_NXP_EXT_LOCK_SHIFT)) & OTPC_LOCK_NXP_EXT_LOCK_MASK)

#define OTPC_LOCK_BOOT_CFG_LOCK_MASK             (0xE00U)
#define OTPC_LOCK_BOOT_CFG_LOCK_SHIFT            (9U)
/*! BOOT_CFG_LOCK - Boot config Lock */
#define OTPC_LOCK_BOOT_CFG_LOCK(x)               (((uint32_t)(((uint32_t)(x)) << OTPC_LOCK_BOOT_CFG_LOCK_SHIFT)) & OTPC_LOCK_BOOT_CFG_LOCK_MASK)

#define OTPC_LOCK_PRINCE_CFG_LOCK_MASK           (0x7000U)
#define OTPC_LOCK_PRINCE_CFG_LOCK_SHIFT          (12U)
/*! PRINCE_CFG_LOCK - Prince Config Lock */
#define OTPC_LOCK_PRINCE_CFG_LOCK(x)             (((uint32_t)(((uint32_t)(x)) << OTPC_LOCK_PRINCE_CFG_LOCK_SHIFT)) & OTPC_LOCK_PRINCE_CFG_LOCK_MASK)

#define OTPC_LOCK_OSCAA_KEY_LOCK_MASK            (0x38000U)
#define OTPC_LOCK_OSCAA_KEY_LOCK_SHIFT           (15U)
/*! OSCAA_KEY_LOCK - OSCAA Key Lock */
#define OTPC_LOCK_OSCAA_KEY_LOCK(x)              (((uint32_t)(((uint32_t)(x)) << OTPC_LOCK_OSCAA_KEY_LOCK_SHIFT)) & OTPC_LOCK_OSCAA_KEY_LOCK_MASK)

#define OTPC_LOCK_CUST_LOCK0_MASK                (0x1C0000U)
#define OTPC_LOCK_CUST_LOCK0_SHIFT               (18U)
/*! CUST_LOCK0 - CUST Lock 0 */
#define OTPC_LOCK_CUST_LOCK0(x)                  (((uint32_t)(((uint32_t)(x)) << OTPC_LOCK_CUST_LOCK0_SHIFT)) & OTPC_LOCK_CUST_LOCK0_MASK)

#define OTPC_LOCK_CUST_LOCK1_MASK                (0xE00000U)
#define OTPC_LOCK_CUST_LOCK1_SHIFT               (21U)
/*! CUST_LOCK1 - CUST Lock 1 */
#define OTPC_LOCK_CUST_LOCK1(x)                  (((uint32_t)(((uint32_t)(x)) << OTPC_LOCK_CUST_LOCK1_SHIFT)) & OTPC_LOCK_CUST_LOCK1_MASK)

#define OTPC_LOCK_CUST_LOCK2_MASK                (0x7000000U)
#define OTPC_LOCK_CUST_LOCK2_SHIFT               (24U)
/*! CUST_LOCK2 - CUST Lock 2 */
#define OTPC_LOCK_CUST_LOCK2(x)                  (((uint32_t)(((uint32_t)(x)) << OTPC_LOCK_CUST_LOCK2_SHIFT)) & OTPC_LOCK_CUST_LOCK2_MASK)

#define OTPC_LOCK_CUST_LOCK3_MASK                (0x38000000U)
#define OTPC_LOCK_CUST_LOCK3_SHIFT               (27U)
/*! CUST_LOCK3 - CUST Lock 3 */
#define OTPC_LOCK_CUST_LOCK3(x)                  (((uint32_t)(((uint32_t)(x)) << OTPC_LOCK_CUST_LOCK3_SHIFT)) & OTPC_LOCK_CUST_LOCK3_MASK)
/*! @} */

/*! @name SECURE - Secure */
/*! @{ */

#define OTPC_SECURE_DAT_MASK                     (0xFFFFFFFFU)
#define OTPC_SECURE_DAT_SHIFT                    (0U)
/*! DAT - Data */
#define OTPC_SECURE_DAT(x)                       (((uint32_t)(((uint32_t)(x)) << OTPC_SECURE_DAT_SHIFT)) & OTPC_SECURE_DAT_MASK)
/*! @} */

/*! @name SECURE_INV - Inverted Secure */
/*! @{ */

#define OTPC_SECURE_INV_DAT_MASK                 (0xFFFFFFFFU)
#define OTPC_SECURE_INV_DAT_SHIFT                (0U)
/*! DAT - Data */
#define OTPC_SECURE_INV_DAT(x)                   (((uint32_t)(((uint32_t)(x)) << OTPC_SECURE_INV_DAT_SHIFT)) & OTPC_SECURE_INV_DAT_MASK)
/*! @} */

/*! @name DBG_KEY - Debug and Key */
/*! @{ */

#define OTPC_DBG_KEY_DAT_MASK                    (0xFFFFFFFFU)
#define OTPC_DBG_KEY_DAT_SHIFT                   (0U)
/*! DAT - Data */
#define OTPC_DBG_KEY_DAT(x)                      (((uint32_t)(((uint32_t)(x)) << OTPC_DBG_KEY_DAT_SHIFT)) & OTPC_DBG_KEY_DAT_MASK)
/*! @} */

/*! @name MISC_CFG - MISC Config */
/*! @{ */

